// getter로 string 만들기
class StringConstants {
  static String appName = "TuTi";
  static const baseUrl = 'https://www.tuti-service.site';
}

final jobConstant = [
  'IT/SW',
  '사무/행정',
  '마케팅',
  '건축/건설',
  '영업/상담',
  '디자인',
  '광고/홍보',
];

final skillConstant = [
  '한글/워드',
  '엑셀',
  '일러스트',
  '포토샵',
  '피그마',
  '블랜더',
  '캐드',
  '스케치업',
  '라이노',
  '시장조사',
  '파워포인트',
  '외국어',
];

final daysConstant = [
  '월',
  '화',
  '수',
  '목',
  '금',
  '토',
  '일',
];

const String termsOfUseContents =
    '트티는 회원에게 콘텐츠, 상품 등을 제공하는 서비스 플랫폼입니다. 회원은 컴퓨터, 휴대전화 등 정보통신기기를 사용하여 트티가 회원에게 제공하는 서비스(이하 “서비스”)를 이용할 수 있으며, 서비스의 구체적인 내용과 이용 조건을 이용약관 및 정책, 서비스 페이지 등에서 확인할 수 있습니다.\n이용약관(이하 ”이 약관”)은 서비스 이용과 관련하여 트티와 회원 간의 권리와 의무에 대한 내용을 담고 있습니다.\n1. 계정\n1.1 회원가입\n서비스를 이용하기 위해서는 회원가입에 의하여 생성되는 계정이 필요합니다. 이와 관련하여 트티는 회원에 대한 본인 인증 절차를 진행할 수 있으며, 회원이 회원가입에 필요한 정보 제공을 거절하거나 타인 정보 또는 허위 정보를 입력하는 경우 회원가입이 진행되지 않을 수 있습니다.';
const String minorContents =
    '\n1.2 미성년자\n미성년자는 관련 법령에 따라 회원가입 또는 서비스이용이 제한될 수 있으며, 부모 등 법정대리인의 동의를 얻은 후 서비스이용을 위한 결제를 진행하여야 합니다. 다만 법정대리인이 동의하지 아니한 경우, 미성년자 본인 또는 법정대리인은 결제를 취소할 수 있습니다.\n';
const String updateOfAccountInfo =
    '1.3 계정정보의 갱신\n전자우편주소, 연락처 등 계정정보가 변경된 경우 이를 반영하는 것은 회원의 책임이며 트티의 고의 또는 과실이 없음에도 불구하고 계정정보를 갱신하지 아니하여 발생하는 불이익은 회원이 부담합니다.';
const String privacyPolicyIntroContents =
    '주식회사 이쿠아(이하"회사")는 『개인정보 보호법』 및 관련 법령상의 개인정보 보호규정을 준수하며, 『개인정보 보호법』에 의거한 개인정보 처리방침을 정하여 이용자 권익보호에 최선을 다하고 있습니다.\n회사는 개인정보 처리방침을 통하여 회사가 이용자로부터 제공받은 개인정보를 어떠한 용도와 방식으로 이용하고 있으며, 개인정보보호를 위해 어떠한 조치를 취하고 있는지 알려드립니다.\n';
const String privacyPolicyTableOfContents =
    '1. 개인정보의 처리 목적\n2. 개인정보의 처리 및 보유기간\n3. 처리하는 개인정보의 항목\n';
const String privacyPolicyPurposeOfProcessingPersonalInfo =
    '1. 개인정보의 처리 목적\n회사는 다음의 목적을 위하여 개인정보를 처리합니다.\n① 회원 가입 및 관리\n- 회원제 서비스 이용에 따른 본인 식별, 회원자격 유지ㆍ관리, 서비스 부정이용 방지와 비인가 사용방지, 각종 고지ㆍ통지, 불만처리 및 고객상담 등 민원 처리, 분쟁 조정을 위한 기록보존\n② 재화 또는 서비스 제공\n - 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산, 콘텐츠 제공, 구매 및 요금 결제, 환불, 물품배송, 본인인증, 요금추심\n③ 서비스 개선 및 마케팅 활용\n- 신규 서비스(제품) 개발 및 특화, 이벤트 등 홍보성 정보 전달    - 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악, 회원의 서비스 이용에 대한 통계 분석\n';
const String privacyPolicyProcessingRetentionPeriodOfPersonalInfo =
    '2. 개인정보의 처리 및 보유기간\n회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체없이 파기합니다. 다만, 관계법령의 규정에 의하여 보존할 필요가 있는 경우, 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 회원정보를 보관하며, 이 경우 회사는 해당 개인정보를 분리하여 보관합니다.\n';
const String refundPolicyServiceOfSales =
    '1. 판매 서비스\n구입한 날로부터 7일 이내 이용한 경우 : 결제 대금 전액\n구입한 날로부터 14일 이내 이용한 경우 : 결제 대금의 5/10\n구입한 날로부터 21일 이내 이용한 경우 : 결제 대금의 2/10\n구입한 날로부터 30일 이후 : 없음\n';
const String refundPolicyCoachingRights =
    '2. 코칭권\n코칭권 이용기간 만료 전 : 결제대금 전액\n코칭권 이용기간 만료 후 : 환불 불가\n-코칭권 이용기간은 구매 당시 부여된 기간을 기준으로 합니다.';
const String refundPolicyInquiry =
    '트티 서비스와 관련하여 궁금하신 사항이 있으시면\n고객센터(대표번호: 010-7415-8850 / 이메일: topofcontemporary@gmail.com (평일 10:00~18:00 )로 문의 주시기 바랍니다 ';
